todo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Asynchronous HTTP Client - Clojure - To Do</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-14 11:20:06 CEST"/>
<meta name="author" content="Hubert Iwaniuk"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Asynchronous HTTP Client - Clojure - To Do</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Receive [6/6]</a>
<ul>
<li><a href="#sec-1_1">1.1 Status Line</a></li>
<li><a href="#sec-1_2">1.2 Headers</a></li>
<li><a href="#sec-1_3">1.3 Body</a></li>
<li><a href="#sec-1_4">1.4 Implement response <b>promise</b></a></li>
<li><a href="#sec-1_5">1.5 Consume stream</a></li>
<li><a href="#sec-1_6">1.6 Error function</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Send [6/9]</a>
<ul>
<li><a href="#sec-2_1">2.1 Query parameters</a></li>
<li><a href="#sec-2_2">2.2 Parameters</a></li>
<li><a href="#sec-2_3">2.3 Parameters allowed only on PUT/POST</a></li>
<li><a href="#sec-2_4">2.4 Cookies</a>
<ul>
<li><a href="#sec-2_4_1">2.4.1 Describe</a></li>
</ul>
</li>
<li><a href="#sec-2_5">2.5 PUT/POST body [3/3]</a>
<ul>
<li><a href="#sec-2_5_1">2.5.1 Support sending strings</a></li>
<li><a href="#sec-2_5_2">2.5.2 Support sending map as form encoded data</a></li>
<li><a href="#sec-2_5_3">2.5.3 Support InputStream body</a></li>
</ul>
</li>
<li><a href="#sec-2_6">2.6 All HTTP verbs [6/7] </a>
<ul>
<li><a href="#sec-2_6_1">2.6.1 GET</a></li>
<li><a href="#sec-2_6_2">2.6.2 POST</a></li>
<li><a href="#sec-2_6_3">2.6.3 PUT</a></li>
<li><a href="#sec-2_6_4">2.6.4 DELETE</a></li>
<li><a href="#sec-2_6_5">2.6.5 HEAD</a></li>
<li><a href="#sec-2_6_6">2.6.6 OPTIONS</a></li>
<li><a href="#sec-2_6_7">2.6.7 Others, once supported by AHC-Java</a></li>
</ul>
</li>
<li><a href="#sec-2_7">2.7 PUT/POST streaming body</a></li>
<li><a href="#sec-2_8">2.8 Multipart</a></li>
<li><a href="#sec-2_9">2.9 Authentication</a>
<ul>
<li><a href="#sec-2_9_1">2.9.1 Test Authentication </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Configuration [2/2] </a>
<ul>
<li><a href="#sec-3_1">3.1 Global configuration of AHC [4/4]</a>
<ul>
<li><a href="#sec-3_1_1">3.1.1 Branding User-agent</a></li>
<li><a href="#sec-3_1_2">3.1.2 Connection limiting per host.</a></li>
<li><a href="#sec-3_1_3">3.1.3 Global proxy.</a></li>
<li><a href="#sec-3_1_4">3.1.4 Timeout settings</a></li>
</ul>
</li>
<li><a href="#sec-3_2">3.2 Per request configuration [2/2]</a>
<ul>
<li><a href="#sec-3_2_1">3.2.1 Proxy configuration</a></li>
<li><a href="#sec-3_2_2">3.2.2 Timeout</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Tasks [12/12] </a>
<ul>
<li><a href="#sec-4_1">4.1 License</a></li>
<li><a href="#sec-4_2">4.2 Cleanup namespaces</a>
<ul>
<li><a href="#sec-4_2_1">4.2.1 async.http.client </a></li>
<li><a href="#sec-4_2_2">4.2.2 async.http.client.request </a></li>
</ul>
</li>
<li><a href="#sec-4_3">4.3 Release 0.1.0</a></li>
<li><a href="#sec-4_4">4.4 Release 0.1.1</a></li>
<li><a href="#sec-4_5">4.5 Release 0.2.0</a>
<ul>
<li><a href="#sec-4_5_1">4.5.1 Create a changelog</a></li>
</ul>
</li>
<li><a href="#sec-4_6">4.6 Release 0.2.1 </a></li>
<li><a href="#sec-4_7">4.7 Make tests stand-alone</a></li>
<li><a href="#sec-4_8">4.8 Simplify request preparation</a></li>
<li><a href="#sec-4_9">4.9 Use last argument as key worded map</a></li>
<li><a href="#sec-4_10">4.10 Review documentation</a></li>
<li><a href="#sec-4_11">4.11 Refactoring [1/1]</a>
<ul>
<li><a href="#sec-4_11_1">4.11.1 Refactor <b>execute-request</b> [2/2] </a></li>
</ul>
</li>
<li><a href="#sec-4_12">4.12 Rename to <b>http.async.client</b></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Receive [6/6] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="code">code</span>&nbsp;<span class="rel1">rel1</span></span></h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> <span class="done DONE"> DONE</span> Status Line &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_1">

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> <span class="done DONE"> DONE</span> Headers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_2">

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> <span class="done DONE"> DONE</span> Body &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_3">

<p>   Instead of <b>id</b>, pass <b>(ref {})</b> to callbacks so they have their own
   STM ref'ed map.
</p></div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> <span class="done DONE"> DONE</span> Implement response <b>promise</b> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_4">

</div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5"><span class="section-number-3">1.5</span> <span class="done DONE"> DONE</span> Consume stream &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_5">

</div>

</div>

<div id="outline-container-1_6" class="outline-3">
<h3 id="sec-1_6"><span class="section-number-3">1.6</span> <span class="done DONE"> DONE</span> Error function &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1_6">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Send [6/9] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="code">code</span></span></h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> <span class="done DONE"> DONE</span> Query parameters &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-2_1">

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> <span class="done DONE"> DONE</span> Parameters &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-2_2">

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> <span class="done DONE"> DONE</span> Parameters allowed only on PUT/POST &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-2_3">

</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> <span class="done DONE"> DONE</span> Cookies &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-2_4">


</div>

<div id="outline-container-2_4_1" class="outline-4">
<h4 id="sec-2_4_1"><span class="section-number-4">2.4.1</span> <span class="done DONE"> DONE</span> Describe &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h4>
<div class="outline-text-4" id="text-2_4_1">

</div>
</div>

</div>

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> <span class="done DONE"> DONE</span> PUT/POST body [3/3] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-2_5">


</div>

<div id="outline-container-2_5_1" class="outline-4">
<h4 id="sec-2_5_1"><span class="section-number-4">2.5.1</span> <span class="done DONE"> DONE</span> Support sending strings &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_5_1">

</div>

</div>

<div id="outline-container-2_5_2" class="outline-4">
<h4 id="sec-2_5_2"><span class="section-number-4">2.5.2</span> <span class="done DONE"> DONE</span> Support sending map as form encoded data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_5_2">

</div>

</div>

<div id="outline-container-2_5_3" class="outline-4">
<h4 id="sec-2_5_3"><span class="section-number-4">2.5.3</span> <span class="done DONE"> DONE</span> Support InputStream body &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_5_3">

</div>
</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3">2.6</span> <span class="todo TODO"> TODO</span> All HTTP verbs [6/7] </h3>
<div class="outline-text-3" id="text-2_6">


</div>

<div id="outline-container-2_6_1" class="outline-4">
<h4 id="sec-2_6_1"><span class="section-number-4">2.6.1</span> <span class="done DONE"> DONE</span> GET &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_1">

</div>

</div>

<div id="outline-container-2_6_2" class="outline-4">
<h4 id="sec-2_6_2"><span class="section-number-4">2.6.2</span> <span class="done DONE"> DONE</span> POST &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_2">

</div>

</div>

<div id="outline-container-2_6_3" class="outline-4">
<h4 id="sec-2_6_3"><span class="section-number-4">2.6.3</span> <span class="done DONE"> DONE</span> PUT &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_3">

</div>

</div>

<div id="outline-container-2_6_4" class="outline-4">
<h4 id="sec-2_6_4"><span class="section-number-4">2.6.4</span> <span class="done DONE"> DONE</span> DELETE &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_4">

</div>

</div>

<div id="outline-container-2_6_5" class="outline-4">
<h4 id="sec-2_6_5"><span class="section-number-4">2.6.5</span> <span class="done DONE"> DONE</span> HEAD &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_5">

</div>

</div>

<div id="outline-container-2_6_6" class="outline-4">
<h4 id="sec-2_6_6"><span class="section-number-4">2.6.6</span> <span class="done DONE"> DONE</span> OPTIONS &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h4>
<div class="outline-text-4" id="text-2_6_6">

</div>

</div>

<div id="outline-container-2_6_7" class="outline-4">
<h4 id="sec-2_6_7"><span class="section-number-4">2.6.7</span> <span class="todo TODO"> TODO</span> Others, once supported by AHC-Java &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h4>
<div class="outline-text-4" id="text-2_6_7">

</div>
</div>

</div>

<div id="outline-container-2_7" class="outline-3">
<h3 id="sec-2_7"><span class="section-number-3">2.7</span> <span class="todo TODO"> TODO</span> PUT/POST streaming body &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h3>
<div class="outline-text-3" id="text-2_7">

<p>   That can be done with <b>clojure.core/add-watch</b>.
   Watcher in that scenario will grab new content and write it via
   AHC, or alternatively will <b>clojure.core/send-off</b> to execute
   IO operation in separate thread.
</p></div>

</div>

<div id="outline-container-2_8" class="outline-3">
<h3 id="sec-2_8"><span class="section-number-3">2.8</span> <span class="todo TODO"> TODO</span> Multipart &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h3>
<div class="outline-text-3" id="text-2_8">

</div>

</div>

<div id="outline-container-2_9" class="outline-3">
<h3 id="sec-2_9"><span class="section-number-3">2.9</span> <span class="done DONE"> DONE</span> Authentication &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-2_9">


</div>

<div id="outline-container-2_9_1" class="outline-4">
<h4 id="sec-2_9_1"><span class="section-number-4">2.9.1</span> <span class="done DONE"> DONE</span> Test Authentication </h4>
<div class="outline-text-4" id="text-2_9_1">

</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Configuration [2/2] </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> <span class="done DONE"> DONE</span> Global configuration of AHC [4/4] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h3>
<div class="outline-text-3" id="text-3_1">


</div>

<div id="outline-container-3_1_1" class="outline-4">
<h4 id="sec-3_1_1"><span class="section-number-4">3.1.1</span> <span class="done DONE"> DONE</span> Branding User-agent &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h4>
<div class="outline-text-4" id="text-3_1_1">

</div>

</div>

<div id="outline-container-3_1_2" class="outline-4">
<h4 id="sec-3_1_2"><span class="section-number-4">3.1.2</span> <span class="done DONE"> DONE</span> Connection limiting per host. &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h4>
<div class="outline-text-4" id="text-3_1_2">

</div>

</div>

<div id="outline-container-3_1_3" class="outline-4">
<h4 id="sec-3_1_3"><span class="section-number-4">3.1.3</span> <span class="done DONE"> DONE</span> Global proxy. &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h4>
<div class="outline-text-4" id="text-3_1_3">

</div>

</div>

<div id="outline-container-3_1_4" class="outline-4">
<h4 id="sec-3_1_4"><span class="section-number-4">3.1.4</span> <span class="done DONE"> DONE</span> Timeout settings &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h4>
<div class="outline-text-4" id="text-3_1_4">

<ul>
<li id="sec-3_1_4_1"><span class="done DONE"> DONE</span> Request timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3_1_4_2"><span class="done DONE"> DONE</span> Connection timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3_1_4_3"><span class="done DONE"> DONE</span> Idle connection timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> <span class="done DONE"> DONE</span> Per request configuration [2/2] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h3>
<div class="outline-text-3" id="text-3_2">


</div>

<div id="outline-container-3_2_1" class="outline-4">
<h4 id="sec-3_2_1"><span class="section-number-4">3.2.1</span> <span class="done DONE"> DONE</span> Proxy configuration &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h4>
<div class="outline-text-4" id="text-3_2_1">

</div>

</div>

<div id="outline-container-3_2_2" class="outline-4">
<h4 id="sec-3_2_2"><span class="section-number-4">3.2.2</span> <span class="done DONE"> DONE</span> Timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span></h4>
<div class="outline-text-4" id="text-3_2_2">

<ul>
<li id="sec-3_2_2_1"><span class="done DONE"> DONE</span> Request timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3_2_2_2"><span class="todo TODO"> TODO</span> Connection timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3_2_2_3"><span class="todo TODO"> TODO</span> Idle connection timeout &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel4">rel4</span></span><br/>
</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Tasks [12/12] </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> <span class="done DONE"> DONE</span> License &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-4_1">

</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> <span class="done DONE"> DONE</span> Cleanup namespaces &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-4_2">


</div>

<div id="outline-container-4_2_1" class="outline-4">
<h4 id="sec-4_2_1"><span class="section-number-4">4.2.1</span> async.http.client </h4>
<div class="outline-text-4" id="text-4_2_1">

<p>    Should contain helper functions to call all HTTP verbs.
    Default set of call-backs.
</p></div>

</div>

<div id="outline-container-4_2_2" class="outline-4">
<h4 id="sec-4_2_2"><span class="section-number-4">4.2.2</span> async.http.client.request </h4>
<div class="outline-text-4" id="text-4_2_2">

<p>    Lower level of requesting:
</p><ul>
<li>execute-request
</li>
<li>prepare-request
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> <span class="done DONE"> DONE</span> Release 0.1.0 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-4_3">

</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> <span class="done DONE"> DONE</span> Release 0.1.1 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel2">rel2</span></span></h3>
<div class="outline-text-3" id="text-4_4">

</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> <span class="done DONE"> DONE</span> Release 0.2.0 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-4_5">

<p>   Changes:
</p><ul>
<li>Stream as seq
</li>
<li>Streams used instead of byte vectors (issue-1)
</li>
<li>keyworded maps are used in api
</li>
</ul>


</div>

<div id="outline-container-4_5_1" class="outline-4">
<h4 id="sec-4_5_1"><span class="section-number-4">4.5.1</span> <span class="done DONE"> DONE</span> Create a changelog &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h4>
<div class="outline-text-4" id="text-4_5_1">

</div>
</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> <span class="done DONE"> DONE</span> Release 0.2.1 </h3>
<div class="outline-text-3" id="text-4_6">

<p>   Release bumps version of async-http-client to v1.3.2.
</p></div>

</div>

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3">4.7</span> <span class="done DONE"> DONE</span> Make tests stand-alone &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-4_7">

<p>   Test suite should not fail when there is now hello-www on port 8080.
</p></div>

</div>

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3">4.8</span> <span class="done DONE"> DONE</span> Simplify request preparation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-4_8">

<p>   For now fns like GET will call prepare-get that will call
   prepare-reqeust. I don't think prepare-get is necessary,
   should be quite fine to only use <b>prepare-request</b>.
</p></div>

</div>

<div id="outline-container-4_9" class="outline-3">
<h3 id="sec-4_9"><span class="section-number-3">4.9</span> <span class="done DONE"> DONE</span> Use last argument as key worded map &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-4_9">

<p>   As suggested by <a href="http://blog.licenser.net/">Licenser</a> on #clojure <a href="http://clojure-log.n01se.net/date/2010-07-08.html#i25">here</a>.
</p></div>

</div>

<div id="outline-container-4_10" class="outline-3">
<h3 id="sec-4_10"><span class="section-number-3">4.10</span> <span class="done DONE"> DONE</span> Review documentation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-4_10">

</div>

</div>

<div id="outline-container-4_11" class="outline-3">
<h3 id="sec-4_11"><span class="section-number-3">4.11</span> <span class="done DONE"> DONE</span> Refactoring [1/1] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-4_11">


</div>

<div id="outline-container-4_11_1" class="outline-4">
<h4 id="sec-4_11_1"><span class="section-number-4">4.11.1</span> <span class="done DONE"> DONE</span> Refactor <b>execute-request</b> [2/2] </h4>
<div class="outline-text-4" id="text-4_11_1">

<ul>
<li id="sec-4_11_1_1"><span class="done DONE"> DONE</span> Build checkable promise <br/>
     To check if promise was delivered use <b>delivered?</b>
</li>
</ul>
<ul>
<li id="sec-4_11_1_2"><span class="done DONE"> DONE</span> Unify <b>execute-request</b> and <b>consume-stream</b> interfaces <br/>
<ul>
<li>Use new checkable <b>promise</b> for different parts of response
</li>
<li>Use normal map for response instead of (ref {})
</li>
<li>Provide helper functions to deal with metadata on response
</li>
</ul>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4_12" class="outline-3">
<h3 id="sec-4_12"><span class="section-number-3">4.12</span> <span class="done DONE"> DONE</span> Rename to <b>http.async.client</b> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel3">rel3</span></span></h3>
<div class="outline-text-3" id="text-4_12">

</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-06-14 11:20:06 CEST</p>
<p class="author">Author: Hubert Iwaniuk</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
